# Working with Strings

### Exercise 1 strings
---
The pandas library has a similar set of string functions to those available in python generally.  Because we often want to perform operations on a whole series of data values in a dataframe, we can use pandas string functions to do this:

Let's use the data set 'Housing in London' at 'https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv

Read the dataset into a pandas dataframe and inspect the data.  The date, in this dataset is a string.   If we want to filter for a particular year, we will need to extract the first four letters as a substring.  We can create a new column called **year**, which just contains the year, stored as a number.

The date is written in the format yyyy-mm-dd.  We can split the year around the '-' and then use the first component, converting it to an integer

Reference:  

Series.str.split() *to split a column's strings into components*    
Series.str.get() *to get one of the components after the split*  

You can **daisychain** these together:   

`Series.str.split().str.get()`

Have a go

**Test output**:  

```
0       1999
1       1999
2       1999
3       1999
4       1999
        ... 
1066    2019
1067    2019
1068    2019
1069    2019
1070    2019
Name: year, Length: 1071, dtype: object
```

In [14]:
import pandas as pd

url = "https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv"

housing_df = pd.read_csv(url)

display(housing_df.info)

year_col = housing_df['date'].str.split('-').str.get(0)

# Test
display(year_col)

<bound method DataFrame.info of            code                  area        date  median_salary  \
0     E09000001        city of london  1999-12-01        33020.0
1     E09000002  barking and dagenham  1999-12-01        21480.0
2     E09000003                barnet  1999-12-01        19568.0
3     E09000004                bexley  1999-12-01        18621.0
4     E09000005                 brent  1999-12-01        18532.0
...         ...                   ...         ...            ...
1066  K03000001         great britain  2019-12-01        30446.0
1067  K04000001     england and wales  2019-12-01        30500.0
1068  N92000002      northern ireland  2019-12-01        27434.0
1069  S92000003              scotland  2019-12-01        30000.0
1070  W92000004                 wales  2019-12-01        27500.0

      life_satisfaction mean_salary recycling_pct  population_size  \
0                   NaN       48922             0           6581.0
1                   NaN       23620             3         162444.0
2                   NaN       23128             8         313469.0
3                   NaN       21386            18         217458.0
4                   NaN       20911             6         260317.0
...                 ...         ...           ...              ...
1066                NaN       37603           NaN              NaN
1067                NaN       37865           NaN              NaN
1068                NaN       32083           NaN              NaN
1069                NaN       34916           NaN              NaN
1070                NaN       31251           NaN              NaN

      number_of_jobs  area_size  no_of_houses  borough_flag
0                NaN        NaN           NaN             1
1                NaN        NaN           NaN             1
2                NaN        NaN           NaN             1
3                NaN        NaN           NaN             1
4                NaN        NaN           NaN             1
...              ...        ...           ...           ...
1066             NaN        NaN           NaN             0
1067             NaN        NaN           NaN             0
1068             NaN        NaN           NaN             0
1069             NaN        NaN           NaN             0
1070             NaN        NaN           NaN             0

[1071 rows x 12 columns]>

0       1999
1       1999
2       1999
3       1999
4       1999
        ...
1066    2019
1067    2019
1068    2019
1069    2019
1070    2019
Name: date, Length: 1071, dtype: object

### Exercise 2
---

In exercise 1 you have extracted the year, but it's dtype is 'object' (it is still a string).  You can convert to integer by adding  .astype(int) to the daisychain.

**Test output**:  

```
...
Name: year, Length: 1071, dtype: int64
```

In [19]:
year_col = year_col.astype('int64')

display(year_col)

# Add nex column to the dataframe
housing_df['Year'] = year_col

0       1999
1       1999
2       1999
3       1999
4       1999
        ...
1066    2019
1067    2019
1068    2019
1069    2019
1070    2019
Name: date, Length: 1071, dtype: int64

### Exercise 3
---

All the areas in the data set are in lower case.  To prepare the data for reporting, you may want to capitalise.  Use .str.title() to do this.

In [20]:
housing_df['area'] = housing_df['area'].str.title()

# Test
display(housing_df['area'])

0             City Of London
1       Barking And Dagenham
2                     Barnet
3                     Bexley
4                      Brent
                ...
1066           Great Britain
1067       England And Wales
1068        Northern Ireland
1069                Scotland
1070                   Wales
Name: area, Length: 1071, dtype: object

### Exercise 4 - Filter all areas to find all with 'and' in the name
---

Use str.contains() and a search (e.g. df[df['area'].str.contains()) to filter for all areas with 'and' in the name

**Test output**:  
105 rows × 13 columns

In [21]:
display(housing_df[housing_df['area'].str.contains('And')])

,code,area,date,median_salary,life_satisfaction,mean_salary,recycling_pct,population_size,number_of_jobs,area_size,no_of_houses,borough_flag,Year
1,E09000002,Barking And Dagenham,1999-12-01,21480.0,NaN,23620,3,162444.0,NaN,NaN,NaN,1,1999
12,E09000013,Hammersmith And Fulham,1999-12-01,25000.0,NaN,28555,7,160634.0,NaN,NaN,NaN,1,1999
19,E09000020,Kensington And Chelsea,1999-12-01,20646.0,NaN,28074,13,147678.0,NaN,NaN,NaN,1,1999
35,E12000003,Yorkshire And The Humber,1999-12-01,16527.0,NaN,18977,7,4956325.0,NaN,NaN,NaN,0,1999
47,K04000001,England And Wales,1999-12-01,17974.0,NaN,21549,NaN,51933471.0,NaN,NaN,NaN,0,1999
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1021,E09000002,Barking And Dagenham,2019-12-01,28738.0,NaN,32010,NaN,NaN,NaN,NaN,NaN,1,2019
1032,E09000013,Hammersmith And Fulham,2019-12-01,37990.0,NaN,48362,NaN,NaN,NaN,NaN,NaN,1,2019
1039,E09000020,Kensington And Chelsea,2019-12-01,33000.0,NaN,41741,NaN,NaN,NaN,NaN,NaN,1,2019
1055,E12000003,Yorkshire And The Humber,2019-12-01,27835.0,NaN,32653,NaN,NaN,NaN,NaN,NaN,0,2019
1067,K04000001,England And Wales,2019-12-01,30500.0,NaN,37865,NaN,NaN,NaN,NaN,NaN,0,2019

### Exercise 4
---

Filter the data for all areas starting with 'ba'  

Test output:  
21 rows, all city of london

In [81]:
filter = housing_df[housing_df['area'].str.startswith('Ba')]

# Drop duplicates to only display unique areas starting with Ba 
display (filter.drop_duplicates(subset = ['area']))

,code,area,date,median_salary,life_satisfaction,mean_salary,recycling_pct,population_size,number_of_jobs,area_size,no_of_houses,borough_flag,Year
1,E09000002,Barking And Dagenham,1999-12-01,21480.0,NaN,23620,3,162444.0,NaN,NaN,NaN,1,1999
2,E09000003,Barnet,1999-12-01,19568.0,NaN,23128,8,313469.0,NaN,NaN,NaN,1,1999

### Exercise 5
---
Filter the data for all areas ending with 'ham', for the year 2000

**Test output**:  
4 rows (barking and dagenham, hammersmith and fulham, lewisham, newham)

In [82]:
display(housing_df[housing_df['area'].str.endswith('ham') & (housing_df['Year'] == 2000)])

,code,area,date,median_salary,life_satisfaction,mean_salary,recycling_pct,population_size,number_of_jobs,area_size,no_of_houses,borough_flag,Year
52,E09000002,Barking And Dagenham,2000-12-01,22618.0,NaN,24696,4,163893.0,57000.0,NaN,NaN,1,2000
63,E09000013,Hammersmith And Fulham,2000-12-01,25264.0,NaN,28742,8,164393.0,120000.0,NaN,NaN,1,2000
73,E09000023,Lewisham,2000-12-01,22357.0,NaN,22659,5,252106.0,76000.0,NaN,NaN,1,2000
75,E09000025,Newham,2000-12-01,19437.0,NaN,21609,3,245463.0,79000.0,NaN,NaN,1,2000

### Exercise 6 - new data set
---

Use the data set here:  https://github.com/futureCodersSE/working-with-data/blob/main/Data%20sets/public_use-talent-migration.xlsx?raw=true

Read the data from the sheet 'Skill Migration'  

Inspect the data, then create a new dataframe with the following changes:

1.  Remove the word 'Skills' from the 'skill_group_category' column  
2.  Convert country_code to uppercase  
3.  Filter for regions containing 'Asia'
4.  Remove the skill_group_id and the wb_income columns

**Test output**:  
9969 rows × 10 columns

In [79]:
skill_df = pd.read_excel("https://github.com/futureCodersSE/working-with-data/blob/main/Data%20sets/public_use-talent-migration.xlsx?raw=true", sheet_name="Skill Migration")

# Show info
display(skill_df.info)

# Split around empty space, get first item
skill_df['skill_group_category'] = skill_df['skill_group_category'].str.split(' ').str.get(0)

# Capitalize country code
skill_df['country_code'] = skill_df['country_code'].str.upper()

# Store filtered results in 'filtered_df'
filtered_df = skill_df[skill_df['wb_region'].str.contains('Asia')]

# Drop columns as per specs
filtered_df = filtered_df.drop(columns=['skill_group_id','wb_income'], axis = 1)

# Drop empty columns
filtered_df = filtered_df.dropna(axis = 1, how='all')

display(filtered_df)

<bound method DataFrame.info of       country_code country_name   wb_income            wb_region  \
0               af  Afghanistan  Low income           South Asia
1               af  Afghanistan  Low income           South Asia
2               af  Afghanistan  Low income           South Asia
3               af  Afghanistan  Low income           South Asia
4               af  Afghanistan  Low income           South Asia
...            ...          ...         ...                  ...
17612           zw     Zimbabwe  Low income  Sub-Saharan Africa
17613           zw     Zimbabwe  Low income  Sub-Saharan Africa
17614           zw     Zimbabwe  Low income  Sub-Saharan Africa
17615           zw     Zimbabwe  Low income  Sub-Saharan Africa
17616           zw     Zimbabwe  Low income  Sub-Saharan Africa

       skill_group_id         skill_group_category        skill_group_name  \
0                2549                  Tech Skills  Information Management
1                2608              Business Skills  Operational Efficiency
2                3806  Specialized Industry Skills       National Security
3               50321                  Tech Skills        Software Testing
4                1606  Specialized Industry Skills                    Navy
...               ...                          ...                     ...
17612           12666  Specialized Industry Skills                Teaching
17613            1235  Specialized Industry Skills                  Mining
17614           43756  Specialized Industry Skills       Personal Coaching
17615            1724  Specialized Industry Skills           Public Health
17616             172  Specialized Industry Skills                     Law

       net_per_10K_2015  net_per_10K_2016  net_per_10K_2017  ...  Unnamed: 19  \
0               -791.59           -705.88           -550.04  ...          NaN
1              -1610.25           -933.55           -776.06  ...          NaN
2              -1731.45           -769.68           -756.59  ...          NaN
3               -957.50           -828.54           -964.73  ...          NaN
4              -1510.71           -841.17           -842.32  ...          NaN
...                 ...               ...               ...  ...          ...
17612             71.18             30.68            -18.85  ...          NaN
17613              8.97           -112.85            -35.87  ...          NaN
17614            -53.45            -59.70            -88.01  ...          NaN
17615             15.25            -65.53            -57.22  ...          NaN
17616             40.85             47.16            -31.24  ...          NaN

       Unnamed: 20  Unnamed: 21  Unnamed: 22  Unnamed: 23  Unnamed: 24  \
0              NaN          NaN          NaN          NaN          NaN
1              NaN          NaN          NaN          NaN          NaN
2              NaN          NaN          NaN          NaN          NaN
3              NaN          NaN          NaN          NaN          NaN
4              NaN          NaN          NaN          NaN          NaN
...            ...          ...          ...          ...          ...
17612          NaN          NaN          NaN          NaN          NaN
17613          NaN          NaN          NaN          NaN          NaN
17614          NaN          NaN          NaN          NaN          NaN
17615          NaN          NaN          NaN          NaN          NaN
17616          NaN          NaN          NaN          NaN          NaN

       Unnamed: 25  Unnamed: 26  Unnamed: 27  Unnamed: 28
0              NaN          NaN          NaN          NaN
1              NaN          NaN          NaN          NaN
2              NaN          NaN          NaN          NaN
3              NaN          NaN          NaN          NaN
4              NaN          NaN          NaN          NaN
...            ...          ...          ...          ...
17612          NaN          NaN          NaN          NaN
17613          NaN          NaN          NaN          NaN
17614          NaN          NaN          NaN          NaN
17615          NaN          NaN          NaN          NaN
17616          NaN          NaN          NaN          NaN

[17617 rows x 29 columns]>

,country_code,country_name,wb_region,skill_group_category,skill_group_name,net_per_10K_2015,net_per_10K_2016,net_per_10K_2017,net_per_10K_2018,net_per_10K_2019
0,AF,Afghanistan,South Asia,Tech,Information Management,-791.59,-705.88,-550.04,-680.92,-1208.79
1,AF,Afghanistan,South Asia,Business,Operational Efficiency,-1610.25,-933.55,-776.06,-532.22,-790.09
2,AF,Afghanistan,South Asia,Specialized,National Security,-1731.45,-769.68,-756.59,-600.44,-767.64
3,AF,Afghanistan,South Asia,Tech,Software Testing,-957.50,-828.54,-964.73,-406.50,-739.51
4,AF,Afghanistan,South Asia,Specialized,Navy,-1510.71,-841.17,-842.32,-581.71,-718.64
...,...,...,...,...,...,...,...,...,...,...
17371,VN,Vietnam,East Asia & Pacific,Specialized,Air Force,658.89,291.89,-271.00,219.20,166.99
17372,VN,Vietnam,East Asia & Pacific,Specialized,Cooking,83.81,236.02,-42.85,238.90,180.90
17373,VN,Vietnam,East Asia & Pacific,Business,Sales Leads,511.16,98.13,-355.91,133.89,181.47
17374,VN,Vietnam,East Asia & Pacific,Disruptive,Aerospace Engineering,410.02,42.71,-222.09,138.03,256.55
17375,VN,Vietnam,East Asia & Pacific,Business,Revenue Analysis,315.68,158.12,101.89,277.98,267.58

### Exercise 7 - a data cleaning function

Create a function called **clean_data(df)** that perform the same actions as in Exercise 6, and will *return* the cleaned data set

Format:

```
def clean_data(df):
  # code to clean the data as in exerise 6, then return the final dataframe

cleaned_data = clean_data(migration_data)
```
**Test output:**  
9969 rows × 10 columns

In [88]:
migration_data = pd.read_excel("https://github.com/futureCodersSE/working-with-data/blob/main/Data%20sets/public_use-talent-migration.xlsx?raw=true", sheet_name="Skill Migration")

def clean_data(df):
    # Split around empty space, get first item
    df['skill_group_category'] = df['skill_group_category'].str.split(' ').str.get(0)

    # Capitalize country code
    df['country_code'] = df['country_code'].str.upper()

    # Store filtered results in 'filtered_df'
    df = df[df['wb_region'].str.contains('Asia')]

    # Drop columns as per specs
    df = df.drop(columns=['skill_group_id','wb_income'], axis = 1)

    # Drop empty columns
    df = df.dropna(axis = 1, how='all')

    return df

cleaned_data = clean_data(migration_data)

# Test
display(cleaned_data)

,country_code,country_name,wb_region,skill_group_category,skill_group_name,net_per_10K_2015,net_per_10K_2016,net_per_10K_2017,net_per_10K_2018,net_per_10K_2019
0,AF,Afghanistan,South Asia,Tech,Information Management,-791.59,-705.88,-550.04,-680.92,-1208.79
1,AF,Afghanistan,South Asia,Business,Operational Efficiency,-1610.25,-933.55,-776.06,-532.22,-790.09
2,AF,Afghanistan,South Asia,Specialized,National Security,-1731.45,-769.68,-756.59,-600.44,-767.64
3,AF,Afghanistan,South Asia,Tech,Software Testing,-957.50,-828.54,-964.73,-406.50,-739.51
4,AF,Afghanistan,South Asia,Specialized,Navy,-1510.71,-841.17,-842.32,-581.71,-718.64
...,...,...,...,...,...,...,...,...,...,...
17371,VN,Vietnam,East Asia & Pacific,Specialized,Air Force,658.89,291.89,-271.00,219.20,166.99
17372,VN,Vietnam,East Asia & Pacific,Specialized,Cooking,83.81,236.02,-42.85,238.90,180.90
17373,VN,Vietnam,East Asia & Pacific,Business,Sales Leads,511.16,98.13,-355.91,133.89,181.47
17374,VN,Vietnam,East Asia & Pacific,Disruptive,Aerospace Engineering,410.02,42.71,-222.09,138.03,256.55
17375,VN,Vietnam,East Asia & Pacific,Business,Revenue Analysis,315.68,158.12,101.89,277.98,267.58

### Exercise 8
---

Write a function that will rename the net_per_10K_year columns to be just the year and will replace the 'z' (as in 'specialized') with 's' to Anglicise the spelling. The function should return the cleaned data.  

Hint:  for column names, you can get the name as a string, then use find() to see if 'net_per_10K_' is in the string (the result will not be -1 if it is there), then you can replace the column name

**Test output**:  
17617 rows × 12 columns, with z replace by s in Specialized  
Column names: country_code	country_name	wb_income	wb_region	skill_group_id	skill_group_category	skill_group_name	2015	2016	2017	2018	2019

In [215]:
def renamer(df):
    # Drop empty columns
    df = df.dropna(axis = 1, how='all')
    
    # Iterate through all the columns
    for column in df.columns:
        
        # Check for the net_per_10K_ fragment of string
        if column.find('net_per_10K_') != -1:
            
            # If found, create a new name by splitting the string, then taking 4th element
            columnnew = column.split('_')[3]
            
            # rename the column
            df = df.rename(columns={column: columnnew})
    
    # For the whole dataframe, replace Specialized with Specialised
    df = df.replace({'Specialized': 'Specialised'})
    return df

display(renamer(migration_data))

,country_code,country_name,wb_income,wb_region,skill_group_id,skill_group_category,skill_group_name,2015,2016,2017,2018,2019
0,AF,Afghanistan,Low income,South Asia,2549,Tech,Information Management,-791.59,-705.88,-550.04,-680.92,-1208.79
1,AF,Afghanistan,Low income,South Asia,2608,Business,Operational Efficiency,-1610.25,-933.55,-776.06,-532.22,-790.09
2,AF,Afghanistan,Low income,South Asia,3806,Specialised,National Security,-1731.45,-769.68,-756.59,-600.44,-767.64
3,AF,Afghanistan,Low income,South Asia,50321,Tech,Software Testing,-957.50,-828.54,-964.73,-406.50,-739.51
4,AF,Afghanistan,Low income,South Asia,1606,Specialised,Navy,-1510.71,-841.17,-842.32,-581.71,-718.64
...,...,...,...,...,...,...,...,...,...,...,...,...
17612,ZW,Zimbabwe,Low income,Sub-Saharan Africa,12666,Specialised,Teaching,71.18,30.68,-18.85,-68.89,-93.70
17613,ZW,Zimbabwe,Low income,Sub-Saharan Africa,1235,Specialised,Mining,8.97,-112.85,-35.87,-65.38,-93.46
17614,ZW,Zimbabwe,Low income,Sub-Saharan Africa,43756,Specialised,Personal Coaching,-53.45,-59.70,-88.01,-55.90,-82.23
17615,ZW,Zimbabwe,Low income,Sub-Saharan Africa,1724,Specialised,Public Health,15.25,-65.53,-57.22,-39.39,-32.14
17616,ZW,Zimbabwe,Low income,Sub-Saharan Africa,172,Specialised,Law,40.85,47.16,-31.24,-8.24,-25.52

### Exercise 9
---

Read the 'Country Migration' sheet.

Write a function that will:  
*  convert the country codes to upper case  
*  drop the lat and long columns for both base and target  
*  rename the net_per_10K_year columns to year only  
*  filter for base_country_wb_region contains 'Africa' and target_country_wb_region contains Asia  

**Test output**:  
```
base_country_code	base_country_name	base_country_wb_income	base_country_wb_region	target_country_code	target_country_name	target_country_wb_income	target_country_wb_region	2015	2016	2017	2018	2019
0	AE	United Arab Emirates	High Income	Middle East & North Africa	AF	Afghanistan	Low Income	South Asia	0.19	0.16	0.11	-0.05	-0.02
4	AE	United Arab Emirates	High Income	Middle East & North Africa	AM	Armenia	Upper Middle Income	Europe & Central Asia	0.10	0.05	0.03	-0.01	0.02
5	AE	United Arab Emirates	High Income	Middle East & North Africa	AU	Australia	High Income	East Asia & Pacific	-1.06	-3.31	-4.01	-4.58	-4.09
6	AE	United Arab Emirates	High Income	Middle East & North Africa	AT	Austria	High Income	Europe & Central Asia	0.11	-0.08	-0.07	-0.05	-0.16
7	AE	United Arab Emirates	High Income	Middle East & North Africa	AZ	Azerbaijan	Upper Middle Income	Europe & Central Asia	0.24	0.25	0.10	0.05	0.04
...	...	...	...	...	...	...	...	...	...	...	...	...	...
4132	ZM	Zambia	Lower Middle Income	Sub-Saharan Africa	GB	United Kingdom	High Income	Europe & Central Asia	43.27	27.60	7.88	6.90	3.68
4135	ZW	Zimbabwe	Low Income	Sub-Saharan Africa	AU	Australia	High Income	East Asia & Pacific	-1.31	-2.33	-2.10	-2.08	-1.84
4138	ZW	Zimbabwe	Low Income	Sub-Saharan Africa	IS	Iceland	High Income	Europe & Central Asia	8.52	6.22	2.35	1.81	0.97
4142	ZW	Zimbabwe	Low Income	Sub-Saharan Africa	NO	Norway	High Income	Europe & Central Asia	2.88	6.46	2.10	0.33	-0.13
4145	ZW	Zimbabwe	Low Income	Sub-Saharan Africa	GB	United Kingdom	High Income	Europe & Central Asia	3.91	4.66	0.74	-0.66	-1.97
478 rows × 13 columns
```

In [220]:
migration_country = pd.read_excel("https://github.com/futureCodersSE/working-with-data/blob/main/Data%20sets/public_use-talent-migration.xlsx?raw=true", sheet_name="Country Migration")

def cleaner_2(df):
    
    # Capitalize country codes
    df['base_country_code'] = df['base_country_code'].str.upper()
    df['target_country_code'] = df['target_country_code'].str.upper()
    
    # Drop columns as per specs
    df = df.drop(columns=['base_lat', 'base_long', 'target_lat', 'target_long'], axis = 1)
    
    # Run the previously created renamer function to change columns' names as per specs
    df = renamer(df)
    
    # Filter as per specs
    df = df[df['base_country_wb_region'].str.contains('Africa') & df['target_country_wb_region'].str.contains('Asia')]
    
    return df

display(cleaner_2(migration_country))

,base_country_code,base_country_name,base_country_wb_income,base_country_wb_region,target_country_code,target_country_name,target_country_wb_income,target_country_wb_region,2015,2016,2017,2018,2019
0,AE,United Arab Emirates,High Income,Middle East & North Africa,AF,Afghanistan,Low Income,South Asia,0.19,0.16,0.11,-0.05,-0.02
4,AE,United Arab Emirates,High Income,Middle East & North Africa,AM,Armenia,Upper Middle Income,Europe & Central Asia,0.10,0.05,0.03,-0.01,0.02
5,AE,United Arab Emirates,High Income,Middle East & North Africa,AU,Australia,High Income,East Asia & Pacific,-1.06,-3.31,-4.01,-4.58,-4.09
6,AE,United Arab Emirates,High Income,Middle East & North Africa,AT,Austria,High Income,Europe & Central Asia,0.11,-0.08,-0.07,-0.05,-0.16
7,AE,United Arab Emirates,High Income,Middle East & North Africa,AZ,Azerbaijan,Upper Middle Income,Europe & Central Asia,0.24,0.25,0.10,0.05,0.04
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4132,ZM,Zambia,Lower Middle Income,Sub-Saharan Africa,GB,United Kingdom,High Income,Europe & Central Asia,43.27,27.60,7.88,6.90,3.68
4135,ZW,Zimbabwe,Low Income,Sub-Saharan Africa,AU,Australia,High Income,East Asia & Pacific,-1.31,-2.33,-2.10,-2.08,-1.84
4138,ZW,Zimbabwe,Low Income,Sub-Saharan Africa,IS,Iceland,High Income,Europe & Central Asia,8.52,6.22,2.35,1.81,0.97
4142,ZW,Zimbabwe,Low Income,Sub-Saharan Africa,NO,Norway,High Income,Europe & Central Asia,2.88,6.46,2.10,0.33,-0.13
4145,ZW,Zimbabwe,Low Income,Sub-Saharan Africa,GB,United Kingdom,High Income,Europe & Central Asia,3.91,4.66,0.74,-0.66,-1.97

### Exercise 10
---

Read the data from file 'https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv'.

Write a function that will return a new dataframe with just the married women listed, surname only.

**Test output**:  
```
	PassengerId	Survived	Pclass	Name	Sex	Age	SibSp	Parch	Ticket	Fare	Cabin	Embarked
1	2	1	1	Cumings	female	38.0	1	0	PC 17599	71.2833	C85	C
3	4	1	1	Futrelle	female	35.0	1	0	113803	53.1000	C123	S
8	9	1	3	Johnson	female	27.0	0	2	347742	11.1333	NaN	S
9	10	1	2	Nasser	female	14.0	1	0	237736	30.0708	NaN	C
15	16	1	2	Hewlett	female	55.0	0	0	248706	16.0000	NaN	S
...	...	...	...	...	...	...	...	...	...	...	...	...
871	872	1	1	Beckwith	female	47.0	1	1	11751	52.5542	D35	S
874	875	1	2	Abelson	female	28.0	1	0	P/PP 3381	24.0000	NaN	C
879	880	1	1	Potter	female	56.0	0	1	11767	83.1583	C50	C
880	881	1	2	Shelley	female	25.0	0	1	230433	26.0000	NaN	S
885	886	0	3	Rice	female	39.0	0	5	382652	29.1250	NaN	Q
129 rows × 12 columns
```

In [247]:
titanic = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv')


def married_filter(df):
    
    # Filter only passengers with Mrs title
    df = df[df['Name'].str.contains('Mrs.')]
    
    # Split the name around the comma, then access 1st item on the list
    df['Name'] = df['Name'].str.split(',').str.get(0)
    return df

# Test
display(married_filter(titanic))

<ipython-input-247-131e21031a15>:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'] = df['Name'].str.split(',').str.get(0)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,Cumings,female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,Futrelle,female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,Johnson,female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,Nasser,female,14.0,1,0,237736,30.0708,NaN,C
15,16,1,2,Hewlett,female,55.0,0,0,248706,16.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,Beckwith,female,47.0,1,1,11751,52.5542,D35,S
874,875,1,2,Abelson,female,28.0,1,0,P/PP 3381,24.0000,NaN,C
879,880,1,1,Potter,female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,Shelley,female,25.0,0,1,230433,26.0000,NaN,S
885,886,0,3,Rice,female,39.0,0,5,382652,29.1250,NaN,Q